In [1]:
import pandas as pd
import numpy as np

In [3]:
stuff = { 'A':[1,2,3], 'B':[4,5,6], 'C':[7,np.nan,9] }
my_df = pd.DataFrame(stuff)
my_df

   A  B    C
0  1  4  7.0
1  2  5  NaN
2  3  6  9.0

In [4]:
my_df.dropna() #Drops the entire row with a null value

   A  B    C
0  1  4  7.0
2  3  6  9.0

In [6]:
my_df.dropna(axis = 1) #If you want to drop the column with null value, just set axis to 1

   A  B
0  1  4
1  2  5
2  3  6

In [7]:
my_df.fillna(89)  #If you want to fill the null value

   A  B     C
0  1  4   7.0
1  2  5  89.0
2  3  6   9.0

In [8]:
my_df.fillna(my_df['C'].mean())  #Fill automatically after calculating average of column elements

   A  B    C
0  1  4  7.0
1  2  5  8.0
2  3  6  9.0